/*
 * @file app main file
 * @author nighca <nighca@live.cn>
 */

import 'babel-polyfill'

import './app.less'
import './widget/global'

import React from 'react'
import { render } from 'react-dom'
import { Router, Route, IndexRoute, Redirect } from 'react-router'

import Header from 'widget/header'
import Home from 'page/home'
import List from 'page/list'
import History from 'page/history'
import RouteCSSTransitionGroup from 'widget/route-css-transition-group'

/*class App extends React.Component {
  render() {
    const useAnimation = false

    const main = useAnimation
      ? <RouteCSSTransitionGroup 
          component="div" 
          transitionName="slide" 
          transitionEnterTimeout={400} 
          transitionLeaveTimeout={400} 
          order={[ '', 'home', 'list', 'history' ]}>
          {this.props.main}
        </RouteCSSTransitionGroup>
      : this.props.main

    return (
      <div>
        {this.props.header}
        {main}
      </div>
    )
  }
}

render((
  <Router>
    <Route path="/" component={App}>
      <IndexRoute components={{ header: Header, main: Home }} />

      <Route path="home" components={{ header: Header, main: Home }}>
        <Route path=":week" />
      </Route>

      <Route path="list" components={{ header: Header, main: List }}>
        <Route path=":week" />
      </Route>

      <Route path="history" components={{ header: Header, main: History }} />
    </Route>
  </Router>
), document.getElementById('app-container'))*/

import extract from 'util/extract-keyword'
import { Task as TaskModel } from 'model'

/*TaskModel.list().then(list => {
  console.log(extract(
    list.map(item => item.cnt),
    ['服务', '功能', '预览', '开发', '查看', '名单', '项目', '接入', '接入「', '学习', '增加', '拆分', '的bug', '页开发']
  ))
})*/

console.log(extract(
  //["行业观点","新信息经济“数据+产业+金融”行情演绎值得重视","新财富水晶球请支持我们第一"," 上周标题即提出计算机还会涨多","上周周报观点就是“计算机还会涨多”并论证四个问题","周三板块调整6","3%后","周四早上逆势重点推荐","周四周五连续上涨","六月以来我们一直在思考计算机行业新五年的未来形态","我们首次全市场提出新信息经济生态“数据+产业+金融”","许多朋友或未理解我们想要表达的深刻含义","而最近四个月以来的深度交流得到诸多领导朋友的认可","目前的市场行情也在持续","若仅仅看着信息安全","大数据","国产化","互联网金融","电商等等这些零散的概念","或许我们能抓住几只牛股","但也许我们与更多的机会失之交臂","抑或并未享受牛股的全程","因此不论目前行业的股票走势如何","都建议大家看看我们对信息技术下一站的思考","我们认为这是指明方向的航灯","现阶段我们建议以半年角度进行行业布局","在最近两个月的持续路演中直接了当给领导们表达了我们对计算机行业的观点","即未来的两个投资阶段","一是风险偏好的再起","此阶段直接配置跌幅较大","主题独特的标的","如东方国信","同有科技","启明星辰","浪潮信息","安硕信息","同花顺等等;二是迎接下年估值切换和产业趋势的机会","此阶段我们建议重点配置三个方向","云计算大数据","互联网金融和产业互联网","上周我们联合调研“数据+产业+金融”三维研究体系代表公司金融云Ucloud","中搜网络","新大陆","信雅达","欢迎联系","推荐标的"," 三个方向重点择机布局","第一阶段仍然在持续","而第二个阶段或正来临","而我们目前的投资策略就是站在产业趋势的角度","思考半年的机会","择机布局领头的标的","1","云计算大数据","同有科技","浪潮信息","启明星辰","浪潮软件","东方国信","卫士通","捷成股份等","突出启明星辰","收购已有条件通过","同有科技","浪潮信息","2","互联网金融","新大陆","久其软件","信雅达","航天信息","高伟达","广电运通","证通电子","汉得信息等","突出新大陆","信雅达","3","产业互联网","刚泰控股","捷顺科技等","4","值得注意","新三板经过情绪低点后","迎来买入机会","推荐中搜网络","超级APP 例如昆仑决","东方美食等进展乐观","2C 产品通过API 连接到墨迹天气等畅销APP","流量增速即将明确","人力成本低点达到","这些皆为拐点信号","点点客","行悦信息等",""],
  //["网易成立影视公司 发布三大计划 腾讯科技[微博]梁辰2015年12月18日23","06分享[摘要]三大计划 分别是：将游戏影视化的“树计划”","把影视游戏化的“桥计划”","着力源头孵化新IP的“光计划”","网易成立影视公司 发布三大计划", "腾讯科技讯","梁辰","12月18日","网易游戏宣布正式成立网易影视传媒有限公司","网易方面表示","这是其网易游戏2016年大IP战略的布局之一","与此同时","网易披露了针对影视业务的三大战略","即将游戏影视化的“树计划”","把影视游戏化的“桥计划”","着力源头孵化新IP的“光计划”","网易影视公布了《天下3》和《新大话西游》的影视开发计划","前者的改编影视将与芒果娱乐合作","推出同名电视剧《天下之弈剑听雨》","以及基于这一IP开发的电影和网剧等；后者则将与华策影视进行影视开发","此外","网易影视将与慈文传媒","新丽传媒合作开发重要影视剧的游戏产品",""],
  ["作者：郑道森 光影重梅 ","于冬打动马云","是通过一部《智取威虎山》","“马云很喜欢","看了两遍","”于冬说：“这部戏也奠定了我在中国企业家群体里的地位","之前别人觉得于冬就是跟着香港人拍电影","现在人会说","于冬","牛逼","”","2天前","博纳影业披露私有化回归A股的“买家阵容”：阿里","腾讯","中信证券","复星国际","红衫","软银赛富","以及博纳影业创始人于冬","这些大买家组成了一个“豪华天团”","包括马云","马化腾","郭广昌","沈南鹏","阎焱等诸多大佬","5年前","于冬带着博纳影业赴美上市","现在看来这似乎是一个“错误的决定”","长期低迷的股价让博纳几乎丧失了资本运作的能力","遭遇“失去的五年”；5年后","博纳选择回归","一度对BAT有所忌惮的于冬","最终还是选择了跟阿里和腾讯站在一起","按照他的规划","未来要与阿里联手","快速投资并购实体院线","与腾讯联手开发IP","并且要加速国际化","与好莱坞合作拍英文电影","这位中国电影圈的“大佬”今年刚刚44岁","坐在北京悠唐广场18层的办公室里","于冬神采奕奕：“一些大哥已经功成名就开始享受人生了","我至少还能够再拼搏10年","”","“2016年","我准备每三个月去洛杉矶一次","待一两个月","一家家敲开好莱坞公司的大门","就像我当年拎着包去香港一家家电影公司一家家地谈","”于冬说","于冬是中国电影圈最早对BAT有所忌惮的“大佬”","2014年上海电影节上他提出的“未来整个电影行业都要给BAT打工”的论调","一度横扫电影圈","然而","博纳私有化过程中","于冬最终邀请阿里","腾讯成为他的投资人","根据计划","阿里影业将投资8600万美元","最终持有博纳10%的股权","而腾讯旗下公司将持有博纳约7%","今年两会期间","于冬曾与马云","马化腾","郭广昌等“大佬”有过一次深入交流","大家谈得最多的","就是他们看了《智取威虎山》","“马云说这个电影他看了两遍","马化腾看了也很喜欢","说这是一个好电影","中国电影就该这么干","”于冬说：“包括之前在亚布力论坛","冯仑","雷军等等都跟我说《智取威虎山》拍得好","那个年代的人对《林海雪原》有一种情感","但没想到还能拍成商业电影","还很好看","还勾起了他们的美好回忆","”","正是这部戏","奠定于冬在中国企业家群体里的地位","娱乐资本论：一年间","您对BAT的态度从惶恐变为坦然接受","为什么？","于冬：最初我对互联网资本有一种惶恐","BAT可以买渠道","买系统","买服务","但是电影行业高度依赖内容创意","博纳在电影这种高端内容上的生产能力","以及线下的实体院线","正是这些互联网巨头需要的","我不需要做成阿里这样的生态系统","博纳是一个电影产业垂直整合的小循环","这包括电影制作能力","发行能力","影院管理能力","最重要的是","博纳能源源不断地制作高端影视内容","互联网企业有钱可以不停的并购","但博纳最擅长的是内容制作和实体院线","传统发行","这是互联网用钱解决不了的","它还需要我们","只是大家分工不同而已","娱乐资本论：阿里腾讯的股权份额","是怎样的协商过程？","于冬：今年6月份发布私有化的消息之后","还是有很多人语重心长地劝我","包括拍《捉妖记》的江老板","但我最终还是决定私有化","并且优先引入阿里","腾讯这样的互联网公司","后面这个过程就很快了","对于股权份额","大家都很礼让","现在这是一个豪华的“购买天团”","未来跟腾讯会更多合作开发好的IP","跟阿里除了做内容之外","还有更多关于院线的发展计划","娱乐资本论：阿里和博纳会联手进军院线市场？","于冬：博纳现在有36家电影院","未来还有30家的签约项目","今后我希望借助阿里的力量来实现影院数量的快速增长","并且提升院线的服务水平","院线方面","我们之前虽然做得很好","管理得很好","盈利能力很强","但是发展速度太慢","另一方面","博纳要把自己很强势的发行能力","跟阿里和腾讯在线上的营销推广进行整合","实现营销一体化","当年赴美上市","在现在看来并不是一个明智之选","博纳上市前夕","恰逢美国八大电影公司当中的米高梅倒闭","这让华尔街对整个电影行业都不看好","博纳这样一家来自中国的电影公司","自然难以获得投资人的青睐","如今","博纳影业在美股的市值折合人民币仍然只有50亿元上下","而华谊兄弟总市值已近600亿","光线传媒接近500亿","长期的股价低迷","让博纳很难进行资本运作","“博纳这5年几乎在美股没有融到什么钱","都是内生增长”","过去5年间","博纳的资产大幅增长","盈利能力大幅提升","但仍旧是一个电影公司的格局","相比之下","华谊兄弟已通过大规模收购","完成了“影视娱乐+互联网娱乐+实景娱乐”的布局","光线传媒更是快速完成了从电视节目制作公司向电影公司的转型","2015年以来","光线已收购了数十家电影公司和团队","并且进行了大量的IP储备","“华谊兄弟市值最高的时候","是博纳的13倍","”于冬对于估值显然非常在意：“阿里投资光线24亿","才拿8","8%的股份","这次投给博纳8600万美元","折合5亿多人民币","却拿走博纳10%","”","当私有化的程序逐渐展开","越多越多投资机构惊讶地发现","摆在他们面前的是一块如此优质的资产","国内电影公司在资金上大多捉襟见肘","相比之下","博纳的发行业务和影院业务","每年都会产生大量稳定的现金流","5年在美上市的经历","也让博纳在财务","法务等方面非常规范","下一步","于冬更希望通过IPO的方式登陆A股","而不是借壳","“我已经做好了等3年的打算","”于冬说：“博纳的经营状况很好","我们的股东也愿意陪我们一起慢慢排队","博纳的估值不高","而A股的壳不便宜","与其为了买壳而稀释股份","不如通过IPO","在这个过程当中","博纳也不排除通过其他的方式进行融资","”","娱乐资本论：私有化的过程当中","您一直很犹豫？","于冬：我觉得博纳是被严重低估的","所以萌生了私有化","回归A股的愿望","但我的几个股东还是希望我不要过多受到股价影响","从心理来讲","我也有一种挣扎","再加上A股爆跌","IPO暂停等等","但回归这个想法还是越来越膨胀","长远来看","我的市场我的观众在这里","我拍的电影是为这个市场的13亿人拍的","娱乐资本论：当年赴美上市是一个错误的决定吗？","于冬：我觉得也不能说是错误","只能说是对美国市场懵懵懂懂","或者说是抱着一个理想主义的梦想","到美国去融资","觉得那个是真正的金融中心","电影中心","带着这样一个报效国家","为国争光的理想去的","今天的回归","博纳可以说是兵强马壮","我虽然没有融到很多资本的钱","但博纳是结结实实地发展了五年","资产规模了增长了接近30倍","盈利能力增长了至少20倍","这五年当中我们没有任何一起诉讼","所以当我在今年的上海电影节上宣布博纳私有化这个消息以后","资本市场是一片叫好","半年来找我要股票的投资人不下100多个","投资圈的人说","别的中概股不回都可以理解","但博纳不回归大家不能理解","于冬对于国际化的重视","超出我们的预期","他告诉娱乐资本论","目前投资规模3000万以下的电影","他已经不用过多参与","自己亲自主导的一般都是投资额在1000万美金以上的项目","2015年","博纳30亿票房的目标","已经随着《澳门风云2》《智取威虎山》等电影的上映轻松完成","接下来的《万万没想到》也被市场寄予厚望","2016年","于冬希望每三个月去一次洛杉矶","一待就是一两个月","跟好莱坞的公司一家家去谈","娱乐资本论：博纳的国际化要怎么做？","于冬：我给自己的计划是","2016年","每三个月飞一趟洛杉矶","就像我当年拎着包在香港跟各大公司聊天一样","我当时一句粤语都不会","同样谈下来了","我要撬开博纳跟好莱坞的合作通道","撬开这个市场","这是我的一个野心","博纳这次投资FOX的6部大片","这在好莱坞的圈子里很是震惊","之前他们认为中国最有钱的是王健林","是马云","是复星","但于冬的这个博纳","真的付钱了","真的把2","35亿美金放在那里","好莱坞还是更愿意跟电影圈的人在一起","跟懂规则的人合作","明年后年","好莱坞的这一块投资","会给博纳带来一个巨大的收益","因为都是全球分账","我扩大了中国市场以外的投资收益","接下来","我们要在洛杉矶设办公室","拿一些项目找美国导演","美国制片人来做","也可能做成中美合拍","娱乐资本论：这些项目都会是面向美国市场的美国故事吗？","于冬：美国故事","面向英语市场","我觉得现阶段投资跟好莱坞的合作","要么大家一起拍中文电影","要么一起拍英文电影","现在还没到大规模的来拍两地都能够适应的电影的时候","博纳走出的一步","就是我跟你拍美国的电影","博纳要做到这样的能力","毫无疑问就是一个国际化的公司","未来中国100亿美元票房的市场","加上美国100亿美元票房的市场","这两个这么大的市场中间","博纳一定有很大空间","这些都是我打动马云先生","马化腾先生的地方","因为他们看到于冬还是很专心做电影的","别的大哥都已经功成名就开始享受人生了","我还至少能再拼搏十年","娱乐资本论是国内唯一一个由财经记者和文娱记者共同运营的微信公号","专注于娱乐和财经界的跨界思维碰撞",""],

  //['服务', '功能', '预览', '开发', '查看', '名单', '项目', '接入', '接入「', '学习', '增加', '拆分', '的bug', '页开发']
  []
))
